04_OpenFoam/_ref/OpenFOAM-14/incompressibleVoF/mixerVessel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-0.275 -0.275 -0.125)
    ( 0.275 -0.275 -0.125)
    ( 0.275  0.275 -0.125)
    (-0.275  0.275 -0.125)
    (-0.275 -0.275  1.325)
    ( 0.275 -0.275  1.325)
    ( 0.275  0.275  1.325)
    (-0.275  0.275  1.325)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (88 88 232) simpleGrading (1 1 1)
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
